// **Group members profiles**   
// Each profile consists of (1) avatar, (2) username, (3) personal description, (4) number of "likes" the profile will receive throughout the interaction
	
window.others = {
  "posts" : [
      {
        "avatar": "avatars/others/george.png",
        "username": "James",
        "text": "I’m 22 years old and a senior in college. I'm a marketing major and hope to work on commercials in the future. I love to play video games, listen to music, and spend time with friends",
        "likes": [45000, 50000, 110000, 150000] //4
      },
      {
        "avatar": "avatars/others/sarah.png",
        "username": "Sarah",
        "text": "I’m Sarah, I’m 31 and a professional dancer. I mostly do contemporary and ballet, but I love all kinds of dancing. When I’m not practicing or working, I like checking out art galleries, trying new recipes, and going for walks.",
        "likes": [12000, 14000,15000,35000,80000,100000,110000,150000,20000] //9
      },
      {
        "avatar": "avatars/others/john.png",
        "username": "John",
        "text": "Hi there, I’m 57 years old, married, with two kids. I used to be a computer programmer for about 20 years, but quit to become a writer. I love the outdoors and spending time iwht my family.",
		"likes": [20000, 21000] //2
      },
      {
        "avatar": "avatars/others/anca.png",
        "username": "Jennifer",
        "text": "Right now I'm studying to become a veterinarian. Its my last year of school and Im super excited! School has been super busy, but when I have free time I try to see my friends as much as possible. I love to go to museums and concerts when I can. I’m also a big fan of plays, but I don’t get to see them often.",
        "likes": [10000, 12000, 40000, 80000, 120000] //5
      },
      {
        "avatar": "avatars/others/niki.png",
        "username": "Nick",
        "text": "I’m a 22-year-old college student studying environmental science. I’m passionate about sustainability and climate activism. In my spare time, I enjoy rock climbing, painting, and playing the guitar. My dream is to work on conservation projects around the world.",
        "likes": [40000, 450000, 90000, 100000, 150000, 155000] //6
      },
    {
        "avatar": "avatars/others/mary.png",
        "username": "Mary",
        "text": "Hi! I’m 34 years old. I’m an HR assistant and mainly I provide general support for HR functions. I like listening to music, watching soccer and hanging out with my 2 golden retriever dogs.",
        "likes": [20000, 25000, 95000] //3
      },
      {
        "avatar": "avatars/others/lauren.png",
        "username": "Lauren",
        "text": "Hey! I’m 28, and I am a hairstylist in Pittsburgh. I play piano in my free time and love to walk my black lab, Jules, when the weather is nice. My favorite band is the Beatles and I have 2 nieces who love to come over and bake with me on weekends.",
        "likes": [12000, 38000] //1
      },
          {
        "avatar": "avatars/others/kim.png",
        "username": "Kim",
        "text": "I’m 41 looking to do work in Community work. I like helping people and I’ve been doing Non-profit works to help the local community thrive and reversing environmental impacts! I like cats and crocheting; I love going to cat cafes local to my area.",
        "likes": [10000, 50000, 88000, 11000, 11500, 120000, 15000] //7
      },
      {
        "avatar": "avatars/others/arjen.png",
        "username": "Noah",
        "text": "Hey, I’m Noah, I’m 33 years old, working as a veterinary assistant in New York! I have a wife and two kids who both play soccer. In my free time, I like to read and play chess, and I enjoy cooking for my family.",
        "likes": [12000, 40000, 120000] //3
      },
      {
        "avatar": "avatars/others/heather.png",
        "username": "Heather",
        "text": "Just now I'm finishing up my first year of a difficult science curriculum in university. I also work at a cosmetics counter as a part-time thing. I have a lot planned for my future, and it's really exciting. I want to grow up and be a doctor with a family of lots of little dogs.",
        "likes": [13000, 50000, 80000, 88000, 120000] //5
      },
      {
        "avatar": "avatars/others/jane.png",
        "username": "Beth",
        "text": "Hi! I’m Beth—about to turn 48, mother to three awesome young adults, recently single and dating for the first time in two decades. Yikes. Former HS science teacher turned ultrasound technologist. Love the beach, crossword puzzles, and true crime.",
        "likes": [10000, 50000] //6
      },

    ]
  };